
  #### Terraform Initialization :clipboard: `success`
  #### Terraform Validation :wrench: `success`
  #### Terraform Lint Tests :mag: `success`
  #### Terraform Security Tests :lock: `success`

  <details>
    <summary>Terraform Plan :green_book: success</summary>
    ```terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.aws_iam_policy_document.assume_role_lambda: Reading...[0m[0m
[0m[1mmodule.dev_network.data.aws_availability_zones.available_zones: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.assume_role_lambda: Read complete after 0s [id=2690255455][0m
[0m[1mmodule.dev_network.data.aws_availability_zones.available_zones: Read complete after 0s [id=us-west-2][0m
[0m[1mdata.google_secret_manager_secret_version.bot_token: Reading...[0m[0m
[0m[1mdata.google_secret_manager_secret_version.bot_token: Read complete after 0s [id=projects/175321897329/secrets/tg_bot_token/versions/1][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.aws_eks_cluster.eks[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_eks_cluster" "eks" {
      [32m+[0m[0m access_config             = (known after apply)
      [32m+[0m[0m arn                       = (known after apply)
      [32m+[0m[0m certificate_authority     = (known after apply)
      [32m+[0m[0m cluster_id                = (known after apply)
      [32m+[0m[0m created_at                = (known after apply)
      [32m+[0m[0m enabled_cluster_log_types = (known after apply)
      [32m+[0m[0m endpoint                  = (known after apply)
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m identity                  = (known after apply)
      [32m+[0m[0m kubernetes_network_config = (known after apply)
      [32m+[0m[0m name                      = (known after apply)
      [32m+[0m[0m outpost_config            = (known after apply)
      [32m+[0m[0m platform_version          = (known after apply)
      [32m+[0m[0m role_arn                  = (known after apply)
      [32m+[0m[0m status                    = (known after apply)
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m version                   = (known after apply)
      [32m+[0m[0m vpc_config                = (known after apply)
    }

[1m  # data.aws_eks_cluster_auth.eks[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_eks_cluster_auth" "eks" {
      [32m+[0m[0m id    = (known after apply)
      [32m+[0m[0m name  = (known after apply)
      [32m+[0m[0m token = (sensitive value)
    }

[1m  # data.kubernetes_service.argocd_endpoint[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "kubernetes_service" "argocd_endpoint" {
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m spec   = (known after apply)
      [32m+[0m[0m status = (known after apply)

      [32m+[0m[0m metadata {
          [32m+[0m[0m generation       = (known after apply)
          [32m+[0m[0m name             = "argocd-server"
          [32m+[0m[0m namespace        = "argocd"
          [32m+[0m[0m resource_version = (known after apply)
          [32m+[0m[0m uid              = (known after apply)
        }
    }

[1m  # aws_cloudwatch_metric_alarm.replicas_is_ready[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_metric_alarm" "replicas_is_ready" {
      [32m+[0m[0m actions_enabled                       = true
      [32m+[0m[0m alarm_description                     = (known after apply)
      [32m+[0m[0m alarm_name                            = "app-is-ready-notification"
      [32m+[0m[0m arn                                   = (known after apply)
      [32m+[0m[0m comparison_operator                   = "LessThanThreshold"
      [32m+[0m[0m dimensions                            = {
          [32m+[0m[0m "ClusterName" = "dev-eks-cluster"
          [32m+[0m[0m "Namespace"   = "gymmanagement"
          [32m+[0m[0m "PodName"     = "gym-management-gymmanagement"
        }
      [32m+[0m[0m evaluate_low_sample_count_percentiles = (known after apply)
      [32m+[0m[0m evaluation_periods                    = 1
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m metric_name                           = "replicas_ready"
      [32m+[0m[0m namespace                             = "ContainerInsights"
      [32m+[0m[0m ok_actions                            = (known after apply)
      [32m+[0m[0m period                                = 30
      [32m+[0m[0m statistic                             = "Minimum"
      [32m+[0m[0m tags_all                              = (known after apply)
      [32m+[0m[0m threshold                             = 1
      [32m+[0m[0m treat_missing_data                    = "missing"
    }

[1m  # aws_eks_addon.cloudwatch[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "cloudwatch" {
      [32m+[0m[0m addon_name           = "amazon-cloudwatch-observability"
      [32m+[0m[0m addon_version        = (known after apply)
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m cluster_name         = (known after apply)
      [32m+[0m[0m configuration_values = (known after apply)
      [32m+[0m[0m created_at           = (known after apply)
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m modified_at          = (known after apply)
      [32m+[0m[0m tags_all             = (known after apply)
    }

[1m  # aws_iam_role.iam_for_lambda[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "iam_for_lambda" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "iam_for_lambda_tg_notifier"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # aws_iam_role_policy_attachment.AWSXrayWriteOnlyAccess[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "AWSXrayWriteOnlyAccess" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AWSXrayWriteOnlyAccess"
      [32m+[0m[0m role       = "eksWorkerNodeRole"
    }

[1m  # aws_iam_role_policy_attachment.CloudWatchAgentServerPolicy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "CloudWatchAgentServerPolicy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy"
      [32m+[0m[0m role       = "eksWorkerNodeRole"
    }

[1m  # aws_lambda_function.tg_notifier[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "tg_notifier" {
      [32m+[0m[0m architectures                  = (known after apply)
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m description                    = "Lambda function which receives events from CloudWatch -> SNS service, and POST it to telegram bot API"
      [32m+[0m[0m filename                       = "../tgbot-notifier.zip"
      [32m+[0m[0m function_name                  = "cloudwatch_tg_notifier"
      [32m+[0m[0m handler                        = "lambda_function.lambda_handler"
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m memory_size                    = 128
      [32m+[0m[0m package_type                   = "Zip"
      [32m+[0m[0m publish                        = false
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m runtime                        = "python3.12"
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = "xRh0Up00qoYkEr6+siwHbLQ4oGMh7XZ1FCfCdAhUq2c="
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags_all                       = (known after apply)
      [32m+[0m[0m timeout                        = 3
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m environment {
          [32m+[0m[0m variables = {
              [32m+[0m[0m "TOKEN"   = "7127391936:AAE68lHnPRpXG36bpSw2b15Wpq0mjl2K33M"
              [32m+[0m[0m "USER_ID" = "6325914269"
            }
        }
    }

[1m  # aws_lambda_permission.exec_from_sns[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "exec_from_sns" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = "cloudwatch_tg_notifier"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "sns.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = "AllowExecutionFromSNS"
      [32m+[0m[0m statement_id_prefix = (known after apply)
    }

[1m  # aws_sns_topic.monitoring_notifications[0m will be created
[0m  [32m+[0m[0m resource "aws_sns_topic" "monitoring_notifications" {
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m beginning_archive_time      = (known after apply)
      [32m+[0m[0m content_based_deduplication = false
      [32m+[0m[0m fifo_topic                  = false
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m name                        = "monitoring-notifications"
      [32m+[0m[0m name_prefix                 = (known after apply)
      [32m+[0m[0m owner                       = (known after apply)
      [32m+[0m[0m policy                      = (known after apply)
      [32m+[0m[0m signature_version           = (known after apply)
      [32m+[0m[0m tags_all                    = (known after apply)
      [32m+[0m[0m tracing_config              = (known after apply)
    }

[1m  # aws_sns_topic_subscription.telegram_lambda[0m will be created
[0m  [32m+[0m[0m resource "aws_sns_topic_subscription" "telegram_lambda" {
      [32m+[0m[0m arn                             = (known after apply)
      [32m+[0m[0m confirmation_timeout_in_minutes = 1
      [32m+[0m[0m confirmation_was_authenticated  = (known after apply)
      [32m+[0m[0m endpoint                        = (known after apply)
      [32m+[0m[0m endpoint_auto_confirms          = false
      [32m+[0m[0m filter_policy_scope             = (known after apply)
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m owner_id                        = (known after apply)
      [32m+[0m[0m pending_confirmation            = (known after apply)
      [32m+[0m[0m protocol                        = "lambda"
      [32m+[0m[0m raw_message_delivery            = false
      [32m+[0m[0m topic_arn                       = (known after apply)
    }

[1m  # google_secret_manager_secret.argocd_password[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret" "argocd_password" {
      [32m+[0m[0m create_time           = (known after apply)
      [32m+[0m[0m effective_annotations = (known after apply)
      [32m+[0m[0m effective_labels      = (known after apply)
      [32m+[0m[0m expire_time           = (known after apply)
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m project               = "disco-freedom-409407"
      [32m+[0m[0m secret_id             = "gym-management-argocd_password"
      [32m+[0m[0m terraform_labels      = (known after apply)

      [32m+[0m[0m replication {
          [32m+[0m[0m auto {
            }
        }
    }

[1m  # google_secret_manager_secret.db_password[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret" "db_password" {
      [32m+[0m[0m create_time           = (known after apply)
      [32m+[0m[0m effective_annotations = (known after apply)
      [32m+[0m[0m effective_labels      = (known after apply)
      [32m+[0m[0m expire_time           = (known after apply)
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m project               = "disco-freedom-409407"
      [32m+[0m[0m secret_id             = "gym-management-db_password"
      [32m+[0m[0m terraform_labels      = (known after apply)

      [32m+[0m[0m replication {
          [32m+[0m[0m auto {
            }
        }
    }

[1m  # google_secret_manager_secret.nginx_password[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret" "nginx_password" {
      [32m+[0m[0m create_time           = (known after apply)
      [32m+[0m[0m effective_annotations = (known after apply)
      [32m+[0m[0m effective_labels      = (known after apply)
      [32m+[0m[0m expire_time           = (known after apply)
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m project               = "disco-freedom-409407"
      [32m+[0m[0m secret_id             = "gym-management-nginx_password"
      [32m+[0m[0m terraform_labels      = (known after apply)

      [32m+[0m[0m replication {
          [32m+[0m[0m auto {
            }
        }
    }

[1m  # google_secret_manager_secret_version.argocd_password[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_version" "argocd_password" {
      [32m+[0m[0m create_time           = (known after apply)
      [32m+[0m[0m deletion_policy       = "DELETE"
      [32m+[0m[0m destroy_time          = (known after apply)
      [32m+[0m[0m enabled               = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m is_secret_data_base64 = false
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m secret                = (known after apply)
      [32m+[0m[0m secret_data           = (sensitive value)
      [32m+[0m[0m version               = (known after apply)
    }

[1m  # google_secret_manager_secret_version.db_password[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_version" "db_password" {
      [32m+[0m[0m create_time           = (known after apply)
      [32m+[0m[0m deletion_policy       = "DELETE"
      [32m+[0m[0m destroy_time          = (known after apply)
      [32m+[0m[0m enabled               = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m is_secret_data_base64 = false
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m secret                = (known after apply)
      [32m+[0m[0m secret_data           = (sensitive value)
      [32m+[0m[0m version               = (known after apply)
    }

[1m  # google_secret_manager_secret_version.nginx_password[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_version" "nginx_password" {
      [32m+[0m[0m create_time           = (known after apply)
      [32m+[0m[0m deletion_policy       = "DELETE"
      [32m+[0m[0m destroy_time          = (known after apply)
      [32m+[0m[0m enabled               = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m is_secret_data_base64 = false
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m secret                = (known after apply)
      [32m+[0m[0m secret_data           = (sensitive value)
      [32m+[0m[0m version               = (known after apply)
    }

[1m  # helm_release.argocd[0m will be created
[0m  [32m+[0m[0m resource "helm_release" "argocd" {
      [32m+[0m[0m atomic                     = false
      [32m+[0m[0m chart                      = "argo-cd"
      [32m+[0m[0m cleanup_on_fail            = false
      [32m+[0m[0m create_namespace           = true
      [32m+[0m[0m dependency_update          = false
      [32m+[0m[0m disable_crd_hooks          = false
      [32m+[0m[0m disable_openapi_validation = false
      [32m+[0m[0m disable_webhooks           = false
      [32m+[0m[0m force_update               = false
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m lint                       = false
      [32m+[0m[0m manifest                   = (known after apply)
      [32m+[0m[0m max_history                = 0
      [32m+[0m[0m metadata                   = (known after apply)
      [32m+[0m[0m name                       = "argocd"
      [32m+[0m[0m namespace                  = "argocd"
      [32m+[0m[0m pass_credentials           = false
      [32m+[0m[0m recreate_pods              = false
      [32m+[0m[0m render_subchart_notes      = true
      [32m+[0m[0m replace                    = false
      [32m+[0m[0m repository                 = "https://argoproj.github.io/argo-helm"
      [32m+[0m[0m reset_values               = false
      [32m+[0m[0m reuse_values               = false
      [32m+[0m[0m skip_crds                  = false
      [32m+[0m[0m status                     = "deployed"
      [32m+[0m[0m timeout                    = 300
      [32m+[0m[0m values                     = [
          [32m+[0m[0m <<-EOT
                ---
                configs:
                  repositories:
                    repo1:
                      url: https://github.com/klimantovich/us-west-1-cluster
                      name: gym-management
                      type: git
                server:
                  service:
                    type: LoadBalancer
                    servicePortHttpsAppProtocol: HTTPS
            EOT,
        ]
      [32m+[0m[0m verify                     = false
      [32m+[0m[0m version                    = "5.46.2"
      [32m+[0m[0m wait                       = true
      [32m+[0m[0m wait_for_jobs              = false

      [32m+[0m[0m set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

[1m  # kubectl_manifest.argocd_application[0m will be created
[0m  [32m+[0m[0m resource "kubectl_manifest" "argocd_application" {
      [32m+[0m[0m api_version             = (known after apply)
      [32m+[0m[0m apply_only              = false
      [32m+[0m[0m force_conflicts         = false
      [32m+[0m[0m force_new               = false
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m kind                    = (known after apply)
      [32m+[0m[0m live_manifest_incluster = (sensitive value)
      [32m+[0m[0m live_uid                = (known after apply)
      [32m+[0m[0m name                    = (known after apply)
      [32m+[0m[0m namespace               = (known after apply)
      [32m+[0m[0m server_side_apply       = false
      [32m+[0m[0m uid                     = (known after apply)
      [32m+[0m[0m validate_schema         = true
      [32m+[0m[0m wait_for_rollout        = true
      [32m+[0m[0m yaml_body               = (sensitive value)
      [32m+[0m[0m yaml_body_parsed        = (known after apply)
      [32m+[0m[0m yaml_incluster          = (sensitive value)
    }

[1m  # kubectl_manifest.argocd_project[0m will be created
[0m  [32m+[0m[0m resource "kubectl_manifest" "argocd_project" {
      [32m+[0m[0m api_version             = "argoproj.io/v1alpha1"
      [32m+[0m[0m apply_only              = false
      [32m+[0m[0m force_conflicts         = false
      [32m+[0m[0m force_new               = false
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m kind                    = "AppProject"
      [32m+[0m[0m live_manifest_incluster = (sensitive value)
      [32m+[0m[0m live_uid                = (known after apply)
      [32m+[0m[0m name                    = "dev-project"
      [32m+[0m[0m namespace               = "argocd"
      [32m+[0m[0m server_side_apply       = false
      [32m+[0m[0m uid                     = (known after apply)
      [32m+[0m[0m validate_schema         = true
      [32m+[0m[0m wait_for_rollout        = true
      [32m+[0m[0m yaml_body               = (sensitive value)
      [32m+[0m[0m yaml_body_parsed        = <<-EOT
            apiVersion: argoproj.io/v1alpha1
            kind: AppProject
            metadata:
              finalizers:
              - resources-finalizer.argocd.argoproj.io
              name: dev-project
              namespace: argocd
            spec:
              clusterResourceWhitelist:
              - group: '*'
                kind: Namespace
              destinations:
              - name: in-cluster
                namespace: gymmanagement
                server: https://kubernetes.default.svc
              namespaceResourceWhitelist:
              - group: apps
                kind: Deployment
              - group: '*'
                kind: ConfigMap
              - group: '*'
                kind: Secret
              - group: networking.k8s.io
                kind: Ingress
              - group: '*'
                kind: Service
              sourceRepos:
              - https://github.com/klimantovich/us-west-1-cluster
        EOT
      [32m+[0m[0m yaml_incluster          = (sensitive value)
    }

[1m  # kubernetes_secret.project_cert[0m will be created
[0m  [32m+[0m[0m resource "kubernetes_secret" "project_cert" {
      [32m+[0m[0m data                           = (sensitive value)
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m type                           = "kubernetes.io/tls"
      [32m+[0m[0m wait_for_service_account_token = true

      [32m+[0m[0m metadata {
          [32m+[0m[0m generation       = (known after apply)
          [32m+[0m[0m name             = "ingress-project-tls"
          [32m+[0m[0m namespace        = "default"
          [32m+[0m[0m resource_version = (known after apply)
          [32m+[0m[0m uid              = (known after apply)
        }
    }

[1m  # random_password.argocd_password[0m will be created
[0m  [32m+[0m[0m resource "random_password" "argocd_password" {
      [32m+[0m[0m bcrypt_hash = (sensitive value)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 16
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (sensitive value)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = true
    }

[1m  # random_password.db_password[0m will be created
[0m  [32m+[0m[0m resource "random_password" "db_password" {
      [32m+[0m[0m bcrypt_hash = (sensitive value)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 16
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (sensitive value)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = true
    }

[1m  # random_password.nginx_password[0m will be created
[0m  [32m+[0m[0m resource "random_password" "nginx_password" {
      [32m+[0m[0m bcrypt_hash = (sensitive value)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 16
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (sensitive value)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = true
    }

[1m  # tls_private_key.project_key[0m will be created
[0m  [32m+[0m[0m resource "tls_private_key" "project_key" {
      [32m+[0m[0m algorithm                     = "RSA"
      [32m+[0m[0m ecdsa_curve                   = "P224"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m private_key_openssh           = (sensitive value)
      [32m+[0m[0m private_key_pem               = (sensitive value)
      [32m+[0m[0m private_key_pem_pkcs8         = (sensitive value)
      [32m+[0m[0m public_key_fingerprint_md5    = (known after apply)
      [32m+[0m[0m public_key_fingerprint_sha256 = (known after apply)
      [32m+[0m[0m public_key_openssh            = (known after apply)
      [32m+[0m[0m public_key_pem                = (known after apply)
      [32m+[0m[0m rsa_bits                      = 2048
    }

[1m  # tls_self_signed_cert.project_cert[0m will be created
[0m  [32m+[0m[0m resource "tls_self_signed_cert" "project_cert" {
      [32m+[0m[0m allowed_uses          = [
          [32m+[0m[0m "key_encipherment",
          [32m+[0m[0m "digital_signature",
          [32m+[0m[0m "server_auth",
        ]
      [32m+[0m[0m cert_pem              = (known after apply)
      [32m+[0m[0m early_renewal_hours   = 0
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m is_ca_certificate     = false
      [32m+[0m[0m key_algorithm         = (known after apply)
      [32m+[0m[0m private_key_pem       = (sensitive value)
      [32m+[0m[0m ready_for_renewal     = false
      [32m+[0m[0m set_authority_key_id  = false
      [32m+[0m[0m set_subject_key_id    = false
      [32m+[0m[0m validity_end_time     = (known after apply)
      [32m+[0m[0m validity_period_hours = 72
      [32m+[0m[0m validity_start_time   = (known after apply)

      [32m+[0m[0m subject {
          [32m+[0m[0m common_name = "project.local"
        }
    }

[1m  # module.dev_db.aws_db_instance.default[0m will be created
[0m  [32m+[0m[0m resource "aws_db_instance" "default" {
      [32m+[0m[0m address                               = (known after apply)
      [32m+[0m[0m allocated_storage                     = 10
      [32m+[0m[0m apply_immediately                     = false
      [32m+[0m[0m arn                                   = (known after apply)
      [32m+[0m[0m auto_minor_version_upgrade            = true
      [32m+[0m[0m availability_zone                     = (known after apply)
      [32m+[0m[0m backup_retention_period               = (known after apply)
      [32m+[0m[0m backup_target                         = (known after apply)
      [32m+[0m[0m backup_window                         = (known after apply)
      [32m+[0m[0m ca_cert_identifier                    = (known after apply)
      [32m+[0m[0m character_set_name                    = (known after apply)
      [32m+[0m[0m copy_tags_to_snapshot                 = false
      [32m+[0m[0m db_name                               = "Gym"
      [32m+[0m[0m db_subnet_group_name                  = "dev-db-subnet-group"
      [32m+[0m[0m delete_automated_backups              = true
      [32m+[0m[0m domain_fqdn                           = (known after apply)
      [32m+[0m[0m endpoint                              = (known after apply)
      [32m+[0m[0m engine                                = "mysql"
      [32m+[0m[0m engine_version                        = "5.7"
      [32m+[0m[0m engine_version_actual                 = (known after apply)
      [32m+[0m[0m hosted_zone_id                        = (known after apply)
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m identifier                            = "dev-mysql-master"
      [32m+[0m[0m identifier_prefix                     = (known after apply)
      [32m+[0m[0m instance_class                        = "db.t3.small"
      [32m+[0m[0m iops                                  = (known after apply)
      [32m+[0m[0m kms_key_id                            = (known after apply)
      [32m+[0m[0m latest_restorable_time                = (known after apply)
      [32m+[0m[0m license_model                         = (known after apply)
      [32m+[0m[0m listener_endpoint                     = (known after apply)
      [32m+[0m[0m maintenance_window                    = (known after apply)
      [32m+[0m[0m master_user_secret                    = (known after apply)
      [32m+[0m[0m master_user_secret_kms_key_id         = (known after apply)
      [32m+[0m[0m monitoring_interval                   = 0
      [32m+[0m[0m monitoring_role_arn                   = (known after apply)
      [32m+[0m[0m multi_az                              = false
      [32m+[0m[0m nchar_character_set_name              = (known after apply)
      [32m+[0m[0m network_type                          = (known after apply)
      [32m+[0m[0m option_group_name                     = (known after apply)
      [32m+[0m[0m parameter_group_name                  = (known after apply)
      [32m+[0m[0m password                              = (sensitive value)
      [32m+[0m[0m performance_insights_enabled          = false
      [32m+[0m[0m performance_insights_kms_key_id       = (known after apply)
      [32m+[0m[0m performance_insights_retention_period = (known after apply)
      [32m+[0m[0m port                                  = (known after apply)
      [32m+[0m[0m publicly_accessible                   = false
      [32m+[0m[0m replica_mode                          = (known after apply)
      [32m+[0m[0m replicas                              = (known after apply)
      [32m+[0m[0m resource_id                           = (known after apply)
      [32m+[0m[0m skip_final_snapshot                   = true
      [32m+[0m[0m snapshot_identifier                   = (known after apply)
      [32m+[0m[0m status                                = (known after apply)
      [32m+[0m[0m storage_throughput                    = (known after apply)
      [32m+[0m[0m storage_type                          = (known after apply)
      [32m+[0m[0m tags_all                              = (known after apply)
      [32m+[0m[0m timezone                              = (known after apply)
      [32m+[0m[0m username                              = "root"
      [32m+[0m[0m vpc_security_group_ids                = (known after apply)
    }

[1m  # module.dev_db.aws_db_subnet_group.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_db_subnet_group" "default" {
      [32m+[0m[0m arn                     = (known after apply)
      [32m+[0m[0m description             = "Managed by Terraform"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m name                    = "dev-db-subnet-group"
      [32m+[0m[0m name_prefix             = (known after apply)
      [32m+[0m[0m subnet_ids              = (known after apply)
      [32m+[0m[0m supported_network_types = (known after apply)
      [32m+[0m[0m tags_all                = (known after apply)
      [32m+[0m[0m vpc_id                  = (known after apply)
    }

[1m  # module.dev_db.aws_security_group.db[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "db" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Inbound traffic for db servers"
      [32m+[0m[0m egress                 = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "10.5.0.0/16",
                ]
              [32m+[0m[0m description      = ""
              [32m+[0m[0m from_port        = 0
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "-1"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 0
            },
        ]
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = []
              [32m+[0m[0m description      = ""
              [32m+[0m[0m from_port        = 3306
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = (known after apply)
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 3306
            },
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = []
              [32m+[0m[0m description      = ""
              [32m+[0m[0m from_port        = 3306
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 3306
            },
        ]
      [32m+[0m[0m name                   = "dev-db-sg"
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name" = "dev-db-sg"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Name" = "dev-db-sg"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)
    }

[1m  # module.dev_eks.data.aws_eks_cluster_auth.eks[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_eks_cluster_auth" "eks" {
      [32m+[0m[0m id    = (known after apply)
      [32m+[0m[0m name  = (known after apply)
      [32m+[0m[0m token = (sensitive value)
    }

[1m  # module.dev_eks.data.kubernetes_service.ingress_nginx[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "kubernetes_service" "ingress_nginx" {
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m spec   = (known after apply)
      [32m+[0m[0m status = (known after apply)

      [32m+[0m[0m metadata {
          [32m+[0m[0m generation       = (known after apply)
          [32m+[0m[0m name             = "ingress-nginx-controller"
          [32m+[0m[0m namespace        = "ingress"
          [32m+[0m[0m resource_version = (known after apply)
          [32m+[0m[0m uid              = (known after apply)
        }
    }

[1m  # module.dev_eks.aws_eks_cluster.cluster[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_cluster" "cluster" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m certificate_authority = (known after apply)
      [32m+[0m[0m cluster_id            = (known after apply)
      [32m+[0m[0m created_at            = (known after apply)
      [32m+[0m[0m endpoint              = (known after apply)
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m identity              = (known after apply)
      [32m+[0m[0m name                  = "dev-eks-cluster"
      [32m+[0m[0m platform_version      = (known after apply)
      [32m+[0m[0m role_arn              = (known after apply)
      [32m+[0m[0m status                = (known after apply)
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Name"        = "dev-eks-cluster"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Name"        = "dev-eks-cluster"
        }
      [32m+[0m[0m version               = "1.28"

      [32m+[0m[0m kubernetes_network_config {
          [32m+[0m[0m ip_family         = (known after apply)
          [32m+[0m[0m service_ipv4_cidr = (known after apply)
          [32m+[0m[0m service_ipv6_cidr = (known after apply)
        }

      [32m+[0m[0m vpc_config {
          [32m+[0m[0m cluster_security_group_id = (known after apply)
          [32m+[0m[0m endpoint_private_access   = true
          [32m+[0m[0m endpoint_public_access    = true
          [32m+[0m[0m public_access_cidrs       = [
              [32m+[0m[0m "0.0.0.0/0",
            ]
          [32m+[0m[0m subnet_ids                = (known after apply)
          [32m+[0m[0m vpc_id                    = (known after apply)
        }
    }

[1m  # module.dev_eks.aws_eks_node_group.worker_nodes[0][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_node_group" "worker_nodes" {
      [32m+[0m[0m ami_type               = (known after apply)
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m capacity_type          = "ON_DEMAND"
      [32m+[0m[0m cluster_name           = "dev-eks-cluster"
      [32m+[0m[0m disk_size              = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m instance_types         = [
          [32m+[0m[0m "t2.small",
        ]
      [32m+[0m[0m node_group_name        = "dev-eks-cluster-worker-nodes"
      [32m+[0m[0m node_group_name_prefix = (known after apply)
      [32m+[0m[0m node_role_arn          = (known after apply)
      [32m+[0m[0m release_version        = (known after apply)
      [32m+[0m[0m resources              = (known after apply)
      [32m+[0m[0m status                 = (known after apply)
      [32m+[0m[0m subnet_ids             = (known after apply)
      [32m+[0m[0m tags_all               = (known after apply)
      [32m+[0m[0m version                = (known after apply)

      [32m+[0m[0m scaling_config {
          [32m+[0m[0m desired_size = 2
          [32m+[0m[0m max_size     = 2
          [32m+[0m[0m min_size     = 0
        }

      [32m+[0m[0m update_config {
          [32m+[0m[0m max_unavailable = 1
        }
    }

[1m  # module.dev_eks.aws_iam_role.eksClusterRole[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "eksClusterRole" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "eks.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2008-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "eksClusterRole"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.dev_eks.aws_iam_role.worker_nodes[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "worker_nodes" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "eksWorkerNodeRole"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.dev_eks.aws_iam_role_policy_attachment.ec2ContainerRegistryReadOnly[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ec2ContainerRegistryReadOnly" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      [32m+[0m[0m role       = "eksWorkerNodeRole"
    }

[1m  # module.dev_eks.aws_iam_role_policy_attachment.eksClusterPolicy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "eksClusterPolicy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      [32m+[0m[0m role       = "eksClusterRole"
    }

[1m  # module.dev_eks.aws_iam_role_policy_attachment.eksWorkerNodePolicy[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "eksWorkerNodePolicy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      [32m+[0m[0m role       = "eksWorkerNodeRole"
    }

[1m  # module.dev_eks.aws_iam_role_policy_attachment.eks_CNI_Policy[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "eks_CNI_Policy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      [32m+[0m[0m role       = "eksWorkerNodeRole"
    }

[1m  # module.dev_eks.helm_release.nginx_ingress[0][0m will be created
[0m  [32m+[0m[0m resource "helm_release" "nginx_ingress" {
      [32m+[0m[0m atomic                     = false
      [32m+[0m[0m chart                      = "ingress-nginx"
      [32m+[0m[0m cleanup_on_fail            = false
      [32m+[0m[0m create_namespace           = true
      [32m+[0m[0m dependency_update          = false
      [32m+[0m[0m disable_crd_hooks          = false
      [32m+[0m[0m disable_openapi_validation = false
      [32m+[0m[0m disable_webhooks           = false
      [32m+[0m[0m force_update               = false
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m lint                       = false
      [32m+[0m[0m manifest                   = (known after apply)
      [32m+[0m[0m max_history                = 0
      [32m+[0m[0m metadata                   = (known after apply)
      [32m+[0m[0m name                       = "ingress-nginx"
      [32m+[0m[0m namespace                  = "ingress"
      [32m+[0m[0m pass_credentials           = false
      [32m+[0m[0m recreate_pods              = false
      [32m+[0m[0m render_subchart_notes      = true
      [32m+[0m[0m replace                    = false
      [32m+[0m[0m repository                 = "https://kubernetes.github.io/ingress-nginx"
      [32m+[0m[0m reset_values               = false
      [32m+[0m[0m reuse_values               = false
      [32m+[0m[0m skip_crds                  = false
      [32m+[0m[0m status                     = "deployed"
      [32m+[0m[0m timeout                    = 300
      [32m+[0m[0m verify                     = false
      [32m+[0m[0m version                    = "4.10.0"
      [32m+[0m[0m wait                       = true
      [32m+[0m[0m wait_for_jobs              = false

      [32m+[0m[0m set {
          [32m+[0m[0m name  = "controller.ingressClassResource.default"
          [32m+[0m[0m value = "true"
        }
      [32m+[0m[0m set {
          [32m+[0m[0m name  = "controller.ingressClassResource.name"
          [32m+[0m[0m value = "nginx"
        }
    }

[1m  # module.dev_eks.null_resource.kubectl[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "kubectl" {
      [32m+[0m[0m id = (known after apply)
    }

[1m  # module.dev_network.aws_eip.nat_eip[0][0m will be created
[0m  [32m+[0m[0m resource "aws_eip" "nat_eip" {
      [32m+[0m[0m allocation_id        = (known after apply)
      [32m+[0m[0m association_id       = (known after apply)
      [32m+[0m[0m carrier_ip           = (known after apply)
      [32m+[0m[0m customer_owned_ip    = (known after apply)
      [32m+[0m[0m domain               = "vpc"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m instance             = (known after apply)
      [32m+[0m[0m network_border_group = (known after apply)
      [32m+[0m[0m network_interface    = (known after apply)
      [32m+[0m[0m private_dns          = (known after apply)
      [32m+[0m[0m private_ip           = (known after apply)
      [32m+[0m[0m public_dns           = (known after apply)
      [32m+[0m[0m public_ip            = (known after apply)
      [32m+[0m[0m public_ipv4_pool     = (known after apply)
      [32m+[0m[0m tags                 = {
          [32m+[0m[0m "Name" = "dev-eip-1"
        }
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Name" = "dev-eip-1"
        }
      [32m+[0m[0m vpc                  = (known after apply)
    }

[1m  # module.dev_network.aws_eip.nat_eip[1][0m will be created
[0m  [32m+[0m[0m resource "aws_eip" "nat_eip" {
      [32m+[0m[0m allocation_id        = (known after apply)
      [32m+[0m[0m association_id       = (known after apply)
      [32m+[0m[0m carrier_ip           = (known after apply)
      [32m+[0m[0m customer_owned_ip    = (known after apply)
      [32m+[0m[0m domain               = "vpc"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m instance             = (known after apply)
      [32m+[0m[0m network_border_group = (known after apply)
      [32m+[0m[0m network_interface    = (known after apply)
      [32m+[0m[0m private_dns          = (known after apply)
      [32m+[0m[0m private_ip           = (known after apply)
      [32m+[0m[0m public_dns           = (known after apply)
      [32m+[0m[0m public_ip            = (known after apply)
      [32m+[0m[0m public_ipv4_pool     = (known after apply)
      [32m+[0m[0m tags                 = {
          [32m+[0m[0m "Name" = "dev-eip-2"
        }
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Name" = "dev-eip-2"
        }
      [32m+[0m[0m vpc                  = (known after apply)
    }

[1m  # module.dev_network.aws_internet_gateway.igw[0m will be created
[0m  [32m+[0m[0m resource "aws_internet_gateway" "igw" {
      [32m+[0m[0m arn      = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m owner_id = (known after apply)
      [32m+[0m[0m tags     = {
          [32m+[0m[0m "Name" = "dev-igw"
        }
      [32m+[0m[0m tags_all = {
          [32m+[0m[0m "Name" = "dev-igw"
        }
      [32m+[0m[0m vpc_id   = (known after apply)
    }

[1m  # module.dev_network.aws_nat_gateway.nat[0][0m will be created
[0m  [32m+[0m[0m resource "aws_nat_gateway" "nat" {
      [32m+[0m[0m allocation_id                      = (known after apply)
      [32m+[0m[0m association_id                     = (known after apply)
      [32m+[0m[0m connectivity_type                  = "public"
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m network_interface_id               = (known after apply)
      [32m+[0m[0m private_ip                         = (known after apply)
      [32m+[0m[0m public_ip                          = (known after apply)
      [32m+[0m[0m secondary_private_ip_address_count = (known after apply)
      [32m+[0m[0m secondary_private_ip_addresses     = (known after apply)
      [32m+[0m[0m subnet_id                          = (known after apply)
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "Name" = "dev-nat-gateway-1"
        }
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "Name" = "dev-nat-gateway-1"
        }
    }

[1m  # module.dev_network.aws_nat_gateway.nat[1][0m will be created
[0m  [32m+[0m[0m resource "aws_nat_gateway" "nat" {
      [32m+[0m[0m allocation_id                      = (known after apply)
      [32m+[0m[0m association_id                     = (known after apply)
      [32m+[0m[0m connectivity_type                  = "public"
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m network_interface_id               = (known after apply)
      [32m+[0m[0m private_ip                         = (known after apply)
      [32m+[0m[0m public_ip                          = (known after apply)
      [32m+[0m[0m secondary_private_ip_address_count = (known after apply)
      [32m+[0m[0m secondary_private_ip_addresses     = (known after apply)
      [32m+[0m[0m subnet_id                          = (known after apply)
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "Name" = "dev-nat-gateway-2"
        }
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "Name" = "dev-nat-gateway-2"
        }
    }

[1m  # module.dev_network.aws_route.private_nat_gateway[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route" "private_nat_gateway" {
      [32m+[0m[0m destination_cidr_block = "0.0.0.0/0"
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m instance_id            = (known after apply)
      [32m+[0m[0m instance_owner_id      = (known after apply)
      [32m+[0m[0m nat_gateway_id         = (known after apply)
      [32m+[0m[0m network_interface_id   = (known after apply)
      [32m+[0m[0m origin                 = (known after apply)
      [32m+[0m[0m route_table_id         = (known after apply)
      [32m+[0m[0m state                  = (known after apply)
    }

[1m  # module.dev_network.aws_route.private_nat_gateway[1][0m will be created
[0m  [32m+[0m[0m resource "aws_route" "private_nat_gateway" {
      [32m+[0m[0m destination_cidr_block = "0.0.0.0/0"
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m instance_id            = (known after apply)
      [32m+[0m[0m instance_owner_id      = (known after apply)
      [32m+[0m[0m nat_gateway_id         = (known after apply)
      [32m+[0m[0m network_interface_id   = (known after apply)
      [32m+[0m[0m origin                 = (known after apply)
      [32m+[0m[0m route_table_id         = (known after apply)
      [32m+[0m[0m state                  = (known after apply)
    }

[1m  # module.dev_network.aws_route.public_internet_gateway[0m will be created
[0m  [32m+[0m[0m resource "aws_route" "public_internet_gateway" {
      [32m+[0m[0m destination_cidr_block = "0.0.0.0/0"
      [32m+[0m[0m gateway_id             = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m instance_id            = (known after apply)
      [32m+[0m[0m instance_owner_id      = (known after apply)
      [32m+[0m[0m network_interface_id   = (known after apply)
      [32m+[0m[0m origin                 = (known after apply)
      [32m+[0m[0m route_table_id         = (known after apply)
      [32m+[0m[0m state                  = (known after apply)
    }

[1m  # module.dev_network.aws_route_table.private[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "private" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Name" = "dev-private-route-table-1"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Name" = "dev-private-route-table-1"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # module.dev_network.aws_route_table.private[1][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "private" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Name" = "dev-private-route-table-2"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Name" = "dev-private-route-table-2"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # module.dev_network.aws_route_table.public[0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "public" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Name" = "dev-public-route-table"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Name" = "dev-public-route-table"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # module.dev_network.aws_route_table_association.private[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.dev_network.aws_route_table_association.private[1][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.dev_network.aws_route_table_association.public[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.dev_network.aws_route_table_association.public[1][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.dev_network.aws_subnet.private_subnet[0][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "private_subnet" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-west-2a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.5.3.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name" = "dev-private-1"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name" = "dev-private-1"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.dev_network.aws_subnet.private_subnet[1][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "private_subnet" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-west-2b"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.5.4.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name" = "dev-private-2"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name" = "dev-private-2"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.dev_network.aws_subnet.public_subnet[0][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "public_subnet" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-west-2a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.5.1.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = true
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name" = "dev-public-1"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name" = "dev-public-1"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.dev_network.aws_subnet.public_subnet[1][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "public_subnet" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-west-2b"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.5.2.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = true
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name" = "dev-public-2"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name" = "dev-public-2"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.dev_network.aws_vpc.vpc[0m will be created
[0m  [32m+[0m[0m resource "aws_vpc" "vpc" {
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m cidr_block                           = "10.5.0.0/16"
      [32m+[0m[0m default_network_acl_id               = (known after apply)
      [32m+[0m[0m default_route_table_id               = (known after apply)
      [32m+[0m[0m default_security_group_id            = (known after apply)
      [32m+[0m[0m dhcp_options_id                      = (known after apply)
      [32m+[0m[0m enable_dns_hostnames                 = (known after apply)
      [32m+[0m[0m enable_dns_support                   = true
      [32m+[0m[0m enable_network_address_usage_metrics = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_tenancy                     = "default"
      [32m+[0m[0m ipv6_association_id                  = (known after apply)
      [32m+[0m[0m ipv6_cidr_block                      = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_network_border_group = (known after apply)
      [32m+[0m[0m main_route_table_id                  = (known after apply)
      [32m+[0m[0m owner_id                             = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name" = "dev-vpc"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Name" = "dev-vpc"
        }
    }

[1mPlan:[0m 57 to add, 0 to change, 0 to destroy.
[0m```
  </details>
  
